Templates/normal CC015C.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v01="urn:http://brz.gv.at/ezoll/V01"> 
    <soapenv:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>USERNAME</wsse:Username>
                <wsse:Password>PASSWORD</wsse:Password>           
            </wsse:UsernameToken>         
        </wsse:Security>      
    </soapenv:Header> 
    <soapenv:Body>
        <v01:sendMessages>
        <!--Zero or more repetitions:-->
        <arrayOfTransitRequestBean_1>
            <id>1</id>
            <message><![CDATA[
            <ns2:Msg xmlns:ns2="http://brz.gv.at/ezoll/V01" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"> <ns2:MsgSdr>swp.transit.agent</ns2:MsgSdr> <ns2:MsgRcp>NTA.AT</ns2:MsgRcp>
            <ns2:PrepDT>DATE3</ns2:PrepDT>
            <ns2:ICRef>ICREF</ns2:ICRef>
            <ns2:Appl>acc</ns2:Appl>
            <ns2:Test>1</ns2:Test>
            <ns2:MsgTyp>CC015C</ns2:MsgTyp>
            <ns4:CC015C xmlns:ns4="http://ncts.dgtaxud.ec" xmlns:ns3="urn:eds:datamodel:EDS:EDS_EXTENSIONS:1">
            <Extensions>
            	<ns3:SequenceNumeric>1</ns3:SequenceNumeric>
            	<ns3:Key>HolderOfTheTransitProcedureRIN</ns3:Key>
            	<ns3:Value>ATRIN4952418247</ns3:Value>
            	<ns3:DataType>text</ns3:DataType>
            </Extensions>
            <Extensions>
            	<ns3:SequenceNumeric>2</ns3:SequenceNumeric>
            	<ns3:Key>SpecialSealsIndicator</ns3:Key>
            	<ns3:Value>1</ns3:Value>
            	<ns3:DataType>text</ns3:DataType>
            </Extensions>
            <messageSender>swp.transit.agent</messageSender>
            <messageRecipient>NTA.AT</messageRecipient>
            <preparationDateAndTime>DATE1</preparationDateAndTime>
            <messageIdentification>1.fndpgypxn7</messageIdentification>
            <messageType>CC015C</messageType>
            <correlationIdentifier>test</correlationIdentifier>
            <TransitOperation>
            	<LRN>LRNPREFIX_LRNSUFFIX</LRN>
            	<declarationType>T1</declarationType>
            	<additionalDeclarationType>A</additionalDeclarationType>
            	<security>0</security>
            	<reducedDatasetIndicator>0</reducedDatasetIndicator>
            	<bindingItinerary>0</bindingItinerary>
            </TransitOperation>
            <CustomsOfficeOfDeparture>
            	<referenceNumber>AT100200</referenceNumber>
            </CustomsOfficeOfDeparture>
            <CustomsOfficeOfDestinationDeclared>
            	<referenceNumber>DE002101</referenceNumber>
            </CustomsOfficeOfDestinationDeclared>
            <HolderOfTheTransitProcedure>
            	<identificationNumber>ATEOS9999999991</identificationNumber>
            	<ContactPerson>
            	<name>Claus Thorup</name>
            	<phoneNumber>2105577890</phoneNumber>
            	<eMailAddress>cthor@email.gr</eMailAddress>
            	</ContactPerson>
            </HolderOfTheTransitProcedure>
            <Guarantee>
            	<sequenceNumber>1</sequenceNumber>
            	<guaranteeType>1</guaranteeType>
            	<GuaranteeReference>
            	<sequenceNumber>1</sequenceNumber>
            	<GRN>11AT100000G000EU4</GRN>
            	<accessCode>9776</accessCode>
            	<amountToBeCovered>5</amountToBeCovered>
            	<currency>EUR</currency>
            	</GuaranteeReference>
            </Guarantee>
            <Consignment>
            	<countryOfDispatch>FR</countryOfDispatch>
            	<countryOfDestination>AT</countryOfDestination>
            	<containerIndicator>1</containerIndicator>
            	<inlandModeOfTransport>4</inlandModeOfTransport>
            	<modeOfTransportAtTheBorder>1</modeOfTransportAtTheBorder>
            	<grossMass>60000.204</grossMass>
            	<referenceNumberUCR>23AT12345678EBDT</referenceNumberUCR>
            	<Carrier>
            		<identificationNumber>DE2999996</identificationNumber>
            	</Carrier>
            	<Consignor>
            		<identificationNumber>ATEOS9999999994</identificationNumber>
            		
            	</Consignor>
            	<Consignee>
            		<identificationNumber>DE6079407</identificationNumber>
            		
            	</Consignee>
            	<TransportEquipment>
            		<sequenceNumber>1</sequenceNumber>
            		<containerIdentificationNumber>CSQU3054383</containerIdentificationNumber>
            		<numberOfSeals>1</numberOfSeals>
            		<Seal>
            		<sequenceNumber>1</sequenceNumber>
            		<identifier>F742</identifier>
            		</Seal>
            		<GoodsReference>
            		<sequenceNumber>1</sequenceNumber>
            		<declarationGoodsItemNumber>1</declarationGoodsItemNumber>
            		</GoodsReference>
            	</TransportEquipment>
            	<LocationOfGoods>
            		<typeOfLocation>A</typeOfLocation>
            		<qualifierOfIdentification>V</qualifierOfIdentification>
            		<CustomsOffice>
            			<referenceNumber>AT100200</referenceNumber>
            		</CustomsOffice>
            	</LocationOfGoods>
            	<ActiveBorderTransportMeans>
            		<sequenceNumber>1</sequenceNumber>
            		<customsOfficeAtBorderReferenceNumber>GB000121</customsOfficeAtBorderReferenceNumber>
            		<typeOfIdentification>80</typeOfIdentification>
            		<identificationNumber>56984526487521</identificationNumber>
            		<nationality>GB</nationality>
            		<conveyanceReferenceNumber>AIR1234b</conveyanceReferenceNumber>
            	</ActiveBorderTransportMeans>
            	<PlaceOfLoading>
            		<UNLocode>ATABC</UNLocode>
            		<country>AT</country>
            		<location>Abfaltersbach</location>
            	</PlaceOfLoading>
           	<HouseConsignment>
            	<sequenceNumber>1</sequenceNumber>
            	<grossMass>6000.204</grossMass>
            	<ConsignmentItem>
            		<goodsItemNumber>1</goodsItemNumber>
            		<declarationGoodsItemNumber>1</declarationGoodsItemNumber>
            		<AdditionalSupplyChainActor>
            			<sequenceNumber>1</sequenceNumber>
            			<role>WH</role>
            			<identificationNumber>ATEOS9999999993</identificationNumber>
            		</AdditionalSupplyChainActor>
            		<Commodity>
            			<descriptionOfGoods>Drum, steel</descriptionOfGoods>
            			<cusCode>0010002-7</cusCode>
            			<CommodityCode>
            				<harmonizedSystemSubHeadingCode>152000</harmonizedSystemSubHeadingCode>
            			</CommodityCode>
            			<DangerousGoods>
            				<sequenceNumber>1</sequenceNumber>
            				<UNNumber>0004</UNNumber>
            			</DangerousGoods>
            			<GoodsMeasure>
            				<grossMass>3340.102</grossMass>
            				<netMass>3000</netMass>
            			</GoodsMeasure>
            		</Commodity>
            		<Packaging>
            			<sequenceNumber>1</sequenceNumber>
            			<typeOfPackages>1A</typeOfPackages>
            			<numberOfPackages>10</numberOfPackages>
            			<shippingMarks>0</shippingMarks>
            		</Packaging>
            		<PreviousDocument>
            			<sequenceNumber>1</sequenceNumber>
            			<type>N703</type>
            			<referenceNumber>ABCD123</referenceNumber>
            		</PreviousDocument>
            	</ConsignmentItem>
            </HouseConsignment>
            </Consignment>
            </ns4:CC015C>
            </ns2:Msg>
            ]]></message>
            <operatorId>test</operatorId>
            <!--Optional:-->
        </arrayOfTransitRequestBean_1>
        </v01:sendMessages>
    </soapenv:Body>
</soapenv:Envelope>